Repository: BijjaSagar/Dishaajyoti
Catalog: lib/l10n/app_*.arb
Languages: hi

# appName
source: DishaAjyoti
hi: दिशाज्योति

# appTagline
source: Career & Life Guidance
hi: करियर और जीवन मार्गदर्शन

# common_ok
source: OK
hi: ठीक है

# common_cancel
source: Cancel
hi: रद्द करें

# common_yes
source: Yes
hi: हाँ

# common_no
source: No
hi: नहीं

# common_save
source: Save
hi: सहेजें

# common_delete
source: Delete
hi: हटाएं

# common_edit
source: Edit
hi: संपादित करें

# common_back
source: Back
hi: वापस

# common_next
source: Next
hi: अगला

# common_submit
source: Submit
hi: जमा करें

# common_retry
source: Retry
hi: पुनः प्रयास करें

# common_loading
source: Loading...
hi: लोड हो रहा है...

# common_error
source: Error
hi: त्रुटि

# common_success
source: Success
hi: सफलता

# common_close
source: Close
hi: बंद करें

# common_refresh
source: Refresh
hi: रीफ्रेश करें

# nav_home
source: Home
hi: होम

# nav_services
source: Services
hi: सेवाएं

# nav_reports
source: Reports
hi: रिपोर्ट

# nav_profile
source: Profile
hi: प्रोफाइल

# home_welcome
source: Welcome back,
hi: स्वागत है,

# home_explore_services
source: Explore Services
hi: सेवाएं देखें

# home_reports
source: Reports
hi: रिपोर्ट

# home_spent
source: Spent
hi: खर्च

# home_featured_services
source: Featured Services
hi: विशेष सेवाएं

# home_view_all
source: View All
hi: सभी देखें

# settings_title
source: Settings
hi: सेटिंग्स

# settings_preferences
source: Preferences
hi: प्राथमिकताएं

# settings_notifications
source: Notifications
hi: सूचनाएं

# settings_notifications_desc
source: Receive updates and alerts
hi: अपडेट और अलर्ट प्राप्त करें

# settings_language
source: Language
hi: भाषा

# settings_select_language
source: Select Language
hi: भाषा चुनें

# settings_language_changed
source: Language changed to {language}
hi: भाषा बदलकर {language} कर दी गई

# settings_about
source: About
hi: के बारे में

# settings_about_dishaajyoti
source: About DishaAjyoti
hi: दिशाज्योति के बारे में

# settings_version
source: Version
hi: संस्करण

# settings_legal
source: Legal
hi: कानूनी

# settings_terms
source: Terms & Conditions
hi: नियम और शर्तें

# settings_terms_desc
source: Read our terms of service
hi: हमारी सेवा की शर्तें पढ़ें

# settings_privacy
source: Privacy Policy
hi: गोपनीयता नीति

# settings_privacy_desc
source: How we handle your data
hi: हम आपके डेटा को कैसे संभालते हैं

# settings_notifications_enabled
source: Notifications enabled
hi: सूचनाएं सक्षम हैं

# settings_notifications_disabled
source: Notifications disabled
hi: सूचनाएं अक्षम हैं

# service_free_kundali
source: Free Kundali
hi: मुफ्त कुंडली

# service_ai_kundali
source: AI Kundali Analysis
hi: AI कुंडली विश्लेषण

# service_palmistry
source: Palmistry Reading
hi: हस्तरेखा विज्ञान

# service_numerology
source: Numerology Report
hi: अंकशास्त्र रिपोर्ट

# service_compatibility
source: Marriage Compatibility
hi: विवाह अनुकूलता

# service_free_kundali_desc
source: Get your complete Vedic birth chart with planetary positions and basic predictions
hi: ग्रहों की स्थिति और बुनियादी भविष्यवाणियों के साथ अपना पूर्ण वैदिक जन्म चार्ट प्राप्त करें

# service_ai_kundali_desc
source: Comprehensive AI-powered Vedic astrology report with detailed predictions and remedies
hi: विस्तृत भविष्यवाणियों और उपायों के साथ व्यापक AI-संचालित वैदिक ज्योतिष रिपोर्ट

# service_palmistry_desc
source: AI-powered palm reading analysis from your hand images
hi: आपकी हाथ की छवियों से AI-संचालित हस्तरेखा विश्लेषण

# service_numerology_desc
source: Discover your life path and destiny through the power of numbers
hi: संख्याओं की शक्ति के माध्यम से अपने जीवन पथ और भाग्य की खोज करें

# service_compatibility_desc
source: Check Ashtakoot matching and compatibility for marriage
hi: विवाह के लिए अष्टकूट मिलान और अनुकूलता जांचें

# kundali_choose_method
source: Choose Kundali Method
hi: कुंडली विधि चुनें

# kundali_free_generation
source: Free Kundali Generation
hi: मुफ्त कुंडली निर्माण

# kundali_choose_preferred
source: Choose your preferred method below
hi: नीचे अपनी पसंदीदा विधि चुनें

# kundali_quick_generate
source: Quick Generate
hi: त्वरित निर्माण

# kundali_quick_desc
source: Generate instantly using our system
hi: हमारे सिस्टम का उपयोग करके तुरंत उत्पन्न करें

# kundali_professional
source: Professional Kundali
hi: व्यावसायिक कुंडली

# kundali_professional_desc
source: Use trusted online services
hi: विश्वसनीय ऑनलाइन सेवाओं का उपयोग करें

# kundali_instant_generation
source: Instant generation
hi: तत्काल निर्माण

# kundali_stored_locally
source: Stored locally on device
hi: डिवाइस पर स्थानीय रूप से संग्रहीत

# kundali_basic_calculations
source: Basic calculations
hi: बुनियादी गणना

# kundali_simple_pdf
source: Simple PDF format
hi: सरल PDF प्रारूप

# kundali_accurate_calculations
source: Highly accurate calculations
hi: अत्यधिक सटीक गणना

# kundali_professional_format
source: Professional format
hi: व्यावसायिक प्रारूप

# kundali_detailed_predictions
source: Detailed predictions & insights
hi: विस्तृत भविष्यवाणियां और अंतर्दृष्टि

# kundali_download_pdf
source: Download PDF anytime
hi: कभी भी PDF डाउनलोड करें

# kundali_generate_now
source: Generate Now
hi: अभी उत्पन्न करें

# kundali_get_professional
source: Get Professional
hi: व्यावसायिक प्राप्त करें

# kundali_recommended
source: RECOMMENDED
hi: अनुशंसित

# kundali_both_free
source: Both methods are 100% free
hi: दोनों विधियां 100% मुफ्त हैं

# kundali_professional_info
source: Professional Kundali uses trusted online services for more accurate and detailed results.
hi: व्यावसायिक कुंडली अधिक सटीक और विस्तृत परिणामों के लिए विश्वसनीय ऑनलाइन सेवाओं का उपयोग करती है।

# kundali_my_kundalis
source: My Kundalis
hi: मेरी कुंडलियां

# kundali_no_kundalis
source: No Kundalis Yet
hi: अभी तक कोई कुंडली नहीं

# kundali_create_first
source: Create your first Kundali to get started
hi: शुरू करने के लिए अपनी पहली कुंडली बनाएं

# kundali_new_kundali
source: New Kundali
hi: नई कुंडली

# kundali_create_kundali
source: Create Kundali
hi: कुंडली बनाएं

# kundali_delete_confirm
source: Are you sure you want to delete this Kundali?
hi: क्या आप वाकई इस कुंडली को हटाना चाहते हैं?

# kundali_deleted_success
source: Kundali deleted successfully
hi: कुंडली सफलतापूर्वक हटा दी गई

# kundali_failed_to_delete
source: Failed to delete Kundali
hi: कुंडली हटाने में विफल

# kundali_failed_to_load
source: Failed to load Kundali list
hi: कुंडली सूची लोड करने में विफल

# kundali_lagna
source: Lagna: {sign}
hi: लग्न: {sign}

# kundali_moon
source: Moon: {sign}
hi: चंद्र: {sign}

# auth_login
source: Login
hi: लॉगिन

# auth_signup
source: Sign Up
hi: साइन अप

# auth_email
source: Email
hi: ईमेल

# auth_password
source: Password
hi: पासवर्ड

# auth_confirm_password
source: Confirm Password
hi: पासवर्ड की पुष्टि करें

# auth_full_name
source: Full Name
hi: पूरा नाम

# auth_phone
source: Phone Number
hi: फोन नंबर

# auth_forgot_password
source: Forgot Password?
hi: पासवर्ड भूल गए?

# auth_dont_have_account
source: Don't have an account?
hi: खाता नहीं है?

# auth_already_have_account
source: Already have an account?
hi: पहले से खाता है?

# auth_login_success
source: Login successful!
hi: लॉगिन सफल!

# auth_signup_success
source: Registration successful!
hi: पंजीकरण सफल!

# auth_logout
source: Logout
hi: लॉगआउट

# auth_logout_confirm
source: Are you sure you want to logout from your account?
hi: क्या आप वाकई अपने खाते से लॉगआउट करना चाहते हैं?

# order_confirm
source: Confirm Order
hi: ऑर्डर की पुष्टि करें

# order_service_details
source: Service Details
hi: सेवा विवरण

source: Order Summary
hi: ऑर्डर सारांश

# order_service_price
source: Service Price
hi: सेवा मूल्य

# order_tax_fees
source: Tax & Fees
hi: कर और शुल्क

# order_included
source: Included
hi: शामिल

# order_total_amount
source: Total Amount
hi: कुल राशि

# order_what_you_get
source: What You'll Get
hi: आपको क्या मिलेगा

# order_important_info
source: Important Information
hi: महत्वपूर्ण जानकारी

# order_delivery_time
source: Delivery: {time}
hi: डिलीवरी: {time}

# order_report_generated
source: Report will be generated within {time}
hi: रिपोर्ट {time} के भीतर तैयार की जाएगी

# order_notification_ready
source: You will receive a notification when ready
hi: तैयार होने पर आपको सूचना मिलेगी

# order_download_pdf
source: Report can be downloaded as PDF
hi: रिपोर्ट PDF के रूप में डाउनलोड की जा सकती है

# order_refund_available
source: Refund available if not satisfied
hi: संतुष्ट न होने पर रिफंड उपलब्ध

# order_proceed_payment
source: Proceed to Payment
hi: भुगतान के लिए आगे बढ़ें

source: Order Tracking
hi: ऑर्डर ट्रैकिंग

source: Order Status
hi: ऑर्डर स्थिति

source: Order Number
hi: ऑर्डर नंबर

# payment_title
source: Payment
hi: भुगतान

source: Payment Methods
hi: भुगतान विधियां

# payment_accept_all
source: We accept all major payment methods including:
hi: हम सभी प्रमुख भुगतान विधियों को स्वीकार करते हैं:

# payment_credit_card
source: Credit Card
hi: क्रेडिट कार्ड

# payment_debit_card
source: Debit Card
hi: डेबिट कार्ड

# payment_net_banking
source: Net Banking
hi: नेट बैंकिंग

# payment_wallets
source: Wallets
hi: वॉलेट

# payment_secure
source: Your payment is secure and encrypted. We do not store your card details.
hi: आपका भुगतान सुरक्षित और एन्क्रिप्टेड है। हम आपके कार्ड विवरण संग्रहीत नहीं करते हैं।

# payment_total
source: Total:
hi: कुल:

# payment_success
source: Payment Successful!
hi: भुगतान सफल!

# payment_report_generating
source: Your report is being generated
hi: आपकी रिपोर्ट तैयार की जा रही है

source: Payment Failed
hi: भुगतान विफल

# payment_view_status
source: View Report Status
hi: रिपोर्ट स्थिति देखें

# payment_pay_now
source: Pay Now
hi: अभी भुगतान करें

# report_title
source: Reports
hi: रिपोर्ट

# report_my_reports
source: My Reports
hi: मेरी रिपोर्ट

# report_no_reports
source: No Reports Yet
hi: अभी तक कोई रिपोर्ट नहीं

# report_generate_first
source: Generate your first report to get started
hi: शुरू करने के लिए अपनी पहली रिपोर्ट बनाएं

# report_view_report
source: View Report
hi: रिपोर्ट देखें

# report_download
source: Download
hi: डाउनलोड

# report_share
source: Share
hi: साझा करें

# report_processing
source: Processing Report
hi: रिपोर्ट प्रोसेस हो रही है

# report_generating
source: Your report is being generated
hi: आपकी रिपोर्ट तैयार की जा रही है

# report_please_wait
source: Please wait while we prepare your personalized report
hi: कृपया प्रतीक्षा करें जब तक हम आपकी व्यक्तिगत रिपोर्ट तैयार करते हैं

# report_estimated_time
source: Estimated time: {time}
hi: अनुमानित समय: {time}

# profile_title
source: Profile
hi: प्रोफाइल

source: Profile Information
hi: प्रोफाइल जानकारी

# profile_email
source: Email
hi: ईमेल

# profile_phone
source: Phone
hi: फोन

# profile_total_reports
source: Total Reports
hi: कुल रिपोर्ट

# profile_total_spent
source: Total Spent
hi: कुल खर्च

# profile_settings
source: Settings
hi: सेटिंग्स

# profile_settings_desc
source: Manage your preferences
hi: अपनी प्राथमिकताएं प्रबंधित करें

# profile_help_support
source: Help & Support
hi: सहायता और समर्थन

# profile_help_desc
source: Get help with your account
hi: अपने खाते के साथ सहायता प्राप्त करें

# profile_about
source: About
hi: के बारे में

# profile_about_desc
source: Learn more about DishaAjyoti
hi: दिशाज्योति के बारे में अधिक जानें

# profile_edit
source: Edit Profile
hi: प्रोफाइल संपादित करें

# profile_update_success
source: Profile updated successfully!
hi: प्रोफाइल सफलतापूर्वक अपडेट किया गया!

# palmistry_title
source: Palmistry Analysis
hi: हस्तरेखा विज्ञान विश्लेषण

# palmistry_upload
source: Upload Palm Images
hi: हाथ की छवियां अपलोड करें

# palmistry_left_hand
source: Left Hand
hi: बायां हाथ

# palmistry_right_hand
source: Right Hand
hi: दायां हाथ

# palmistry_capture
source: Capture Image
hi: छवि कैप्चर करें

# palmistry_gallery
source: Choose from Gallery
hi: गैलरी से चुनें

# palmistry_analyze
source: Analyze
hi: विश्लेषण करें

# palmistry_analysis
source: Palm Analysis
hi: हस्तरेखा विश्लेषण

# palmistry_life_line
source: Life Line
hi: जीवन रेखा

# palmistry_heart_line
source: Heart Line
hi: हृदय रेखा

# palmistry_head_line
source: Head Line
hi: मस्तिष्क रेखा

# palmistry_fate_line
source: Fate Line
hi: भाग्य रेखा

# numerology_title
source: Numerology Analysis
hi: अंकशास्त्र विश्लेषण

# numerology_input
source: Enter Details
hi: विवरण दर्ज करें

# numerology_full_name
source: Full Name
hi: पूरा नाम

# numerology_date_of_birth
source: Date of Birth
hi: जन्म तिथि

# numerology_calculate
source: Calculate
hi: गणना करें

source: Numerology Analysis
hi: अंकशास्त्र विश्लेषण

# numerology_life_path
source: Life Path Number
hi: जीवन पथ संख्या

# numerology_destiny
source: Destiny Number
hi: भाग्य संख्या

# numerology_soul_urge
source: Soul Urge Number
hi: आत्मा प्रेरणा संख्या

# compatibility_title
source: Marriage Compatibility
hi: विवाह अनुकूलता

# compatibility_check
source: Check Compatibility
hi: अनुकूलता जांचें

# compatibility_person1
source: Person 1
hi: व्यक्ति 1

# compatibility_person2
source: Person 2
hi: व्यक्ति 2

source: Compatibility Result
hi: अनुकूलता परिणाम

source: Compatibility Score
hi: अनुकूलता स्कोर

# compatibility_ashtakoot
source: Ashtakoot Score
hi: अष्टकूट स्कोर

# compatibility_out_of
source: out of 36
hi: 36 में से

# notifications_title
source: Notifications
hi: सूचनाएं

# notifications_no_notifications
source: No Notifications
hi: कोई सूचना नहीं

# notifications_all_caught_up
source: You're all caught up!
hi: आप सभी अपडेट हैं!

# onboarding_skip
source: Skip
hi: छोड़ें

# onboarding_next
source: Next
hi: अगला

# onboarding_get_started
source: Get Started
hi: शुरू करें

# error_network
source: Network error. Please check your connection and try again.
hi: नेटवर्क त्रुटि। कृपया अपना कनेक्शन जांचें और पुनः प्रयास करें।

# error_server
source: Server error. Please try again later.
hi: सर्वर त्रुटि। कृपया बाद में पुनः प्रयास करें।

# error_unknown
source: An unexpected error occurred. Please try again.
hi: एक अप्रत्याशित त्रुटि हुई। कृपया पुनः प्रयास करें।

# error_session_expired
source: Your session has expired. Please log in again.
hi: आपका सत्र समाप्त हो गया है। कृपया फिर से लॉगिन करें।

# error_invalid_input
source: Please enter valid information.
hi: कृपया मान्य जानकारी दर्ज करें।

# error_required_field
source: This field is required.
hi: यह फ़ील्ड आवश्यक है।

# success_operation
source: Operation completed successfully!
hi: ऑपरेशन सफलतापूर्वक पूर्ण हुआ!

# success_saved
source: Saved successfully!
hi: सफलतापूर्वक सहेजा गया!

source: FREE
hi: मुफ्त

source: Premium
hi: प्रीमियम

# forgot_password_title
source: Forgot Password?
hi: पासवर्ड भूल गए?

# forgot_password_subtitle
source: Enter your email address and we'll send you a link to reset your password
hi: अपना ईमेल पता दर्ज करें और हम आपको अपना पासवर्ड रीसेट करने के लिए एक लिंक भेजेंगे

# forgot_password_email_sent_subtitle
source: Check your email for reset instructions
hi: रीसेट निर्देशों के लिए अपना ईमेल जांचें

# forgot_password_email_label
source: Email
hi: ईमेल

# forgot_password_email_hint
source: Enter your email
hi: अपना ईमेल दर्ज करें

# forgot_password_send_reset_link
source: Send Reset Link
hi: रीसेट लिंक भेजें

# forgot_password_email_sent
source: Email Sent!
hi: ईमेल भेजा गया!

# forgot_password_email_sent_message
source: We've sent a password reset link to {email}
hi: हमने {email} पर पासवर्ड रीसेट लिंक भेजा है

# forgot_password_check_spam
source: Didn't receive the email? Check your spam folder or try again in a few minutes.
hi: ईमेल नहीं मिला? अपना स्पैम फ़ोल्डर जांचें या कुछ मिनटों में पुनः प्रयास करें।

# forgot_password_remember
source: Remember your password?
hi: अपना पासवर्ड याद है?

# forgot_password_back_to_login
source: Back to Login
hi: लॉगिन पर वापस जाएं

# forgot_password_failed
source: Failed to send reset link: {error}
hi: रीसेट लिंक भेजने में विफल: {error}

# profile_setup_title
source: Complete Your Profile
hi: अपनी प्रोफाइल पूर्ण करें

# profile_setup_step_of
source: Step {current} of {total}
hi: चरण {current} का {total}

# profile_setup_birth_details
source: Birth Details
hi: जन्म विवरण

# profile_setup_birth_subtitle
source: Help us understand your astrological profile
hi: हमें अपनी ज्योतिषीय प्रोफ़ाइल समझने में मदद करें

# profile_setup_dob_label
source: Date of Birth
hi: जन्म तिथि

# profile_setup_time_label
source: Time of Birth
hi: जन्म समय

# profile_setup_place_label
source: Place of Birth
hi: जन्म स्थान

# profile_setup_place_hint
source: City, State, Country
hi: शहर, राज्य, देश

# profile_setup_career_info
source: Career Information
hi: करियर जानकारी

# profile_setup_career_subtitle
source: Tell us about your professional journey
hi: हमें अपनी पेशेवर यात्रा के बारे में बताएं

# profile_setup_career_label
source: Current/Past Career
hi: वर्तमान/पिछला करियर

# profile_setup_career_hint
source: e.g., Software Engineer, Teacher, Business Owner
hi: जैसे, सॉफ्टवेयर इंजीनियर, शिक्षक, व्यवसाय स्वामी

# profile_setup_goals_label
source: Career Goals
hi: करियर लक्ष्य

# profile_setup_goals_hint
source: What are your professional aspirations?
hi: आपकी पेशेवर आकांक्षाएं क्या हैं?

# profile_setup_challenges
source: Your Challenges
hi: आपकी चुनौतियां

# profile_setup_challenges_subtitle
source: Share what you're currently facing
hi: साझा करें कि आप वर्तमान में क्या सामना कर रहे हैं

# profile_setup_challenges_label
source: Current Challenges
hi: वर्तमान चुनौतियां

# profile_setup_challenges_hint
source: What obstacles or difficulties are you experiencing?
hi: आप किन बाधाओं या कठिनाइयों का सामना कर रहे हैं?

# profile_setup_privacy_note
source: Your information is kept private and secure. We use it only to provide personalized guidance.
hi: आपकी जानकारी निजी और सुरक्षित रखी जाती है। हम इसका उपयोग केवल व्यक्तिगत मार्गदर्शन प्रदान करने के लिए करते हैं।

# profile_setup_back
source: Back
hi: वापस

# profile_setup_next
source: Next
hi: अगला

# profile_setup_complete
source: Complete
hi: पूर्ण

# profile_setup_success
source: Profile setup completed successfully!
hi: प्रोफाइल सेटअप सफलतापूर्वक पूर्ण हुआ!

# language_select_title
source: Select Language
hi: भाषा चुनें

# language_choose_title
source: Choose Your Language
hi: अपनी भाषा चुनें

# language_choose_subtitle
source: Select your preferred language for the app
hi: ऐप के लिए अपनी पसंदीदा भाषा चुनें

# language_continue
source: Continue
hi: जारी रखें

# language_changed_to
source: Language changed to {language}
hi: भाषा बदलकर {language} कर दी गई

# kundali_detail_title
source: Kundali Details
hi: कुंडली विवरण

# kundali_detail_generate_report
source: Generate Detailed Report
hi: विस्तृत रिपोर्ट बनाएं

# kundali_detail_basic_info
source: Basic Information
hi: मूल जानकारी

# kundali_detail_name
source: Name
hi: नाम

# kundali_detail_dob
source: Date of Birth
hi: जन्म तिथि

# kundali_detail_time
source: Time of Birth
hi: जन्म समय

# kundali_detail_place
source: Place of Birth
hi: जन्म स्थान

# kundali_detail_astrological_info
source: Astrological Information
hi: ज्योतिषीय जानकारी

# kundali_detail_lagna_label
source: Lagna
hi: लग्न

# kundali_detail_moon_sign
source: Moon Sign
hi: चंद्र राशि

# kundali_detail_sun_sign
source: Sun Sign
hi: सूर्य राशि

# kundali_detail_nakshatra
source: Nakshatra
hi: नक्षत्र

# kundali_detail_planetary_positions
source: Planetary Positions
hi: ग्रह स्थिति

# kundali_detail_no_planetary_data
source: No planetary position data available
hi: कोई ग्रह स्थिति डेटा उपलब्ध नहीं है

# kundali_detail_houses
source: Houses
hi: भाव

# kundali_detail_no_house_data
source: No house data available
hi: कोई भाव डेटा उपलब्ध नहीं है

# kundali_detail_house_label
source: House {number}: {sign}
hi: भाव {number}: {sign}

# kundali_detail_failed_to_load
source: Failed to load Kundali details
hi: कुंडली विवरण लोड करने में विफल

# kundali_detail_report_generated
source: Report generated successfully
hi: रिपोर्ट सफलतापूर्वक बनाई गई

# kundali_detail_report_failed
source: Failed to generate report
hi: रिपोर्ट बनाने में विफल

# kundali_form_title
source: Free Kundali
hi: मुफ्त कुंडली

# kundali_form_header
source: Get Your Free Kundali
hi: अपनी मुफ्त कुंडली प्राप्त करें

# kundali_form_subtitle
source: Enter your birth details to generate your personalized Kundali
hi: अपनी व्यक्तिगत कुंडली बनाने के लिए अपने जन्म विवरण दर्ज करें

# kundali_form_name_label
source: Full Name
hi: पूरा नाम

# kundali_form_name_hint
source: Enter your full name
hi: अपना पूरा नाम दर्ज करें

# kundali_form_name_required
source: Please enter your name
hi: कृपया अपना नाम दर्ज करें

# kundali_form_dob_label
source: Date of Birth
hi: जन्म तिथि

# kundali_form_dob_hint
source: Select your date of birth
hi: अपनी जन्म तिथि चुनें

# kundali_form_dob_required
source: Please select your date of birth
hi: कृपया अपनी जन्म तिथि चुनें

# kundali_form_time_label
source: Time of Birth
hi: जन्म समय

# kundali_form_time_hint
source: Select your time of birth
hi: अपना जन्म समय चुनें

# kundali_form_time_required
source: Please select your time of birth
hi: कृपया अपना जन्म समय चुनें

# kundali_form_place_label
source: Place of Birth
hi: जन्म स्थान

# kundali_form_place_hint
source: Enter your place of birth (e.g., Mumbai, India)
hi: अपना जन्म स्थान दर्ज करें (जैसे, मुंबई, भारत)

# kundali_form_place_required
source: Please enter your place of birth
hi: कृपया अपना जन्म स्थान दर्ज करें

# kundali_form_auto_fill_coords
source: Auto-Fill Coordinates
hi: स्वतः निर्देशांक भरें

# kundali_form_fetching_coords
source: Fetching Coordinates...
hi: निर्देशांक प्राप्त किए जा रहे हैं...

# kundali_form_latitude_label
source: Latitude
hi: अक्षांश

# kundali_form_latitude_hint
source: e.g., 19.0760 (for Mumbai)
hi: जैसे, 19.0760 (मुंबई के लिए)

# kundali_form_latitude_required
source: Please enter latitude
hi: कृपया अक्षांश दर्ज करें

# kundali_form_latitude_invalid
source: Latitude must be between -90 and 90
hi: अक्षांश -90 और 90 के बीच होना चाहिए

# kundali_form_longitude_label
source: Longitude
hi: देशांतर

# kundali_form_longitude_hint
source: e.g., 72.8777 (for Mumbai)
hi: जैसे, 72.8777 (मुंबई के लिए)

# kundali_form_longitude_required
source: Please enter longitude
hi: कृपया देशांतर दर्ज करें

# kundali_form_longitude_invalid
source: Longitude must be between -180 and 180
hi: देशांतर -180 और 180 के बीच होना चाहिए

# kundali_form_info
source: Your Kundali will be calculated using Vedic Astrology with Lahiri Ayanamsa. Includes birth chart, planetary positions, houses, nakshatras, and Vimshottari Dasha.
hi: आपकी कुंडली लाहिड़ी अयनांश के साथ वैदिक ज्योतिष का उपयोग करके गणना की जाएगी। जन्म चार्ट, ग्रह स्थिति, भाव, नक्षत्र और विम्शोत्तरी दशा शामिल है।

# kundali_form_generate
source: Generate Free Kundali
hi: मुफ्त कुंडली बनाएं

# kundali_form_generating_title
source: AI Generating Kundali
hi: AI कुंडली बना रहा है

# kundali_form_generating_message
source: Calculating planetary positions and creating your personalized birth chart...
hi: ग्रह स्थिति की गणना और आपका व्यक्तिगत जन्म चार्ट बना रहे हैं...

# kundali_form_coords_found
source: Coordinates found for {place}
hi: {place} के लिए निर्देशांक मिले

# kundali_form_coords_not_found
source: Could not find coordinates. Please enter manually.
hi: निर्देशांक नहीं मिले। कृपया मैन्युअल रूप से दर्ज करें।

# kundali_form_success
source: Kundali generated successfully!
hi: कुंडली सफलतापूर्वक बनाई गई!

# kundali_form_failed
source: Failed to generate Kundali: {error}
hi: कुंडली बनाने में विफल: {error}

# kundali_input_title
source: Generate Kundali
hi: कुंडली बनाएं

# kundali_input_header
source: Enter Birth Details
hi: जन्म विवरण दर्ज करें

# kundali_input_subtitle
source: Provide accurate birth information for precise Kundali analysis
hi: सटीक कुंडली विश्लेषण के लिए सटीक जन्म जानकारी प्रदान करें

# kundali_input_name_label
source: Full Name
hi: पूरा नाम

# kundali_input_name_hint
source: Enter your full name
hi: अपना पूरा नाम दर्ज करें

# kundali_input_name_required
source: Please enter your name
hi: कृपया अपना नाम दर्ज करें

# kundali_input_dob_label
source: Date of Birth
hi: जन्म तिथि

# kundali_input_dob_hint
source: Select date of birth
hi: जन्म तिथि चुनें
