Repository: BijjaSagar/Dishaajyoti
Catalog: lib/l10n/app_*.arb
Languages: hi

# kundali_input_dob_select
source: Select date
hi: तारीख चुनें

# kundali_input_dob_required
source: Please select date of birth
hi: कृपया जन्म तिथि चुनें

# kundali_input_time_label
source: Time of Birth
hi: जन्म समय

# kundali_input_time_hint
source: Select time of birth
hi: जन्म समय चुनें

# kundali_input_time_select
source: Select time
hi: समय चुनें

# kundali_input_time_required
source: Please select time of birth
hi: कृपया जन्म समय चुनें

# kundali_input_place_label
source: Place of Birth
hi: जन्म स्थान

# kundali_input_place_hint
source: Enter city name
hi: शहर का नाम दर्ज करें

# kundali_input_place_required
source: Please enter place of birth
hi: कृपया जन्म स्थान दर्ज करें

# kundali_input_fetch_coords
source: Fetch Coordinates
hi: निर्देशांक प्राप्त करें

# kundali_input_coords_success
source: Coordinates fetched successfully
hi: निर्देशांक सफलतापूर्वक प्राप्त किए गए

# kundali_input_coords_failed
source: Failed to fetch coordinates
hi: निर्देशांक प्राप्त करने में विफल

# kundali_input_coords_display
source: Coordinates: {lat}, {lon}
hi: निर्देशांक: {lat}, {lon}

# kundali_input_coords_required
source: Please fetch coordinates for the birth place
hi: कृपया जन्म स्थान के लिए निर्देशांक प्राप्त करें

# kundali_input_generate
source: Generate Kundali
hi: कुंडली बनाएं

# kundali_input_note
source: Note: Accurate birth time is crucial for precise Kundali analysis. If exact time is unknown, use approximate time.
hi: नोट: सटीक कुंडली विश्लेषण के लिए सटीक जन्म समय महत्वपूर्ण है। यदि सटीक समय अज्ञात है, तो अनुमानित समय का उपयोग करें।

# kundali_input_success
source: Kundali generated successfully
hi: कुंडली सफलतापूर्वक बनाई गई

# kundali_input_failed
source: Failed to generate Kundali
hi: कुंडली बनाने में विफल

# kundali_input_place_first
source: Please enter a place name first
hi: कृपया पहले स्थान का नाम दर्ज करें

# kundali_webview_title
source: Generate Kundali Online
hi: ऑनलाइन कुंडली बनाएं

# kundali_webview_fill_details
source: Fill in your details and generate Kundali
hi: अपने विवरण भरें और कुंडली बनाएं

# kundali_webview_download_pdf
source: You can download the PDF from the website
hi: आप वेबसाइट से PDF डाउनलोड कर सकते हैं

# compatibility_check_title
source: Check Marriage Compatibility
hi: विवाह अनुकूलता जांचें

# compatibility_check_subtitle
source: Enter birth details of both individuals for Ashtakoot matching
hi: अष्टकूट मिलान के लिए दोनों व्यक्तियों के जन्म विवरण दर्ज करें

# compatibility_name_label
source: Full Name
hi: पूरा नाम

# compatibility_name_hint
source: Enter full name
hi: पूरा नाम दर्ज करें

# compatibility_name_required
source: Please enter name
hi: कृपया नाम दर्ज करें

# compatibility_dob_label
source: Date of Birth
hi: जन्म तिथि

# compatibility_dob_select
source: Select date
hi: तारीख चुनें

# compatibility_dob_required
source: Please select both dates of birth
hi: कृपया दोनों जन्म तिथियां चुनें

# compatibility_time_label
source: Time of Birth
hi: जन्म समय

# compatibility_time_select
source: Select time
hi: समय चुनें

# compatibility_time_required
source: Please select both times of birth
hi: कृपया दोनों जन्म समय चुनें

# compatibility_place_label
source: Place of Birth
hi: जन्म स्थान

# compatibility_place_hint
source: Enter city name
hi: शहर का नाम दर्ज करें

# compatibility_place_required
source: Please enter place
hi: कृपया स्थान दर्ज करें

# compatibility_fetch_coords
source: Fetch Coordinates
hi: निर्देशांक प्राप्त करें

# compatibility_coords_success
source: Coordinates fetched successfully
hi: निर्देशांक सफलतापूर्वक प्राप्त किए गए

# compatibility_coords_failed
source: Failed to fetch coordinates
hi: निर्देशांक प्राप्त करने में विफल

# compatibility_coords_display
source: Coordinates: {lat}, {lon}
hi: निर्देशांक: {lat}, {lon}

# compatibility_coords_required
source: Please fetch coordinates for both birth places
hi: कृपया दोनों जन्म स्थानों के लिए निर्देशांक प्राप्त करें

# compatibility_check_button
source: Check Compatibility
hi: अनुकूलता जांचें

# compatibility_note
source: Ashtakoot matching analyzes 8 compatibility factors based on Vedic astrology principles.
hi: अष्टकूट मिलान वैदिक ज्योतिष सिद्धांतों के आधार पर 8 अनुकूलता कारकों का विश्लेषण करता है।

source: Compatibility analysis completed
hi: अनुकूलता विश्लेषण पूर्ण

# compatibility_analysis_failed
source: Analysis Failed
hi: विश्लेषण विफल

# compatibility_place_first
source: Please enter a place name first
hi: कृपया पहले स्थान का नाम दर्ज करें

# compatibility_result_title
source: Compatibility Result
hi: अनुकूलता परिणाम

# compatibility_result_ashtakoot_score
source: Ashtakoot Compatibility Score
hi: अष्टकूट अनुकूलता स्कोर

# compatibility_result_out_of
source: out of 36
hi: 36 में से

# compatibility_result_excellent
source: Excellent Match
hi: उत्कृष्ट मेल

# compatibility_result_very_good
source: Very Good Match
hi: बहुत अच्छा मेल

# compatibility_result_good
source: Good Match
hi: अच्छा मेल

# compatibility_result_average
source: Average Match
hi: औसत मेल

# compatibility_result_challenging
source: Challenging Match
hi: चुनौतीपूर्ण मेल

# compatibility_result_detailed_analysis
source: Detailed Ashtakoot Analysis
hi: विस्तृत अष्टकूट विश्लेषण

# compatibility_result_varna
source: Varna
hi: वर्ण

# compatibility_result_varna_desc
source: Spiritual compatibility
hi: आध्यात्मिक अनुकूलता

# compatibility_result_vashya
source: Vashya
hi: वश्य

# compatibility_result_vashya_desc
source: Mutual attraction
hi: पारस्परिक आकर्षण

# compatibility_result_tara
source: Tara
hi: तारा

# compatibility_result_tara_desc
source: Birth star compatibility
hi: जन्म नक्षत्र अनुकूलता

# compatibility_result_yoni
source: Yoni
hi: योनि

# compatibility_result_yoni_desc
source: Physical compatibility
hi: शारीरिक अनुकूलता

# compatibility_result_graha_maitri
source: Graha Maitri
hi: ग्रह मैत्री

# compatibility_result_graha_maitri_desc
source: Mental compatibility
hi: मानसिक अनुकूलता

# compatibility_result_gana
source: Gana
hi: गण

# compatibility_result_gana_desc
source: Temperament
hi: स्वभाव

# compatibility_result_bhakoot
source: Bhakoot
hi: भकूट

# compatibility_result_bhakoot_desc
source: Love and affection
hi: प्रेम और स्नेह

# compatibility_result_nadi
source: Nadi
hi: नाड़ी

# compatibility_result_nadi_desc
source: Health and genes
hi: स्वास्थ्य और जीन

# compatibility_result_no_mangal_dosha
source: No Mangal Dosha
hi: कोई मंगल दोष नहीं

# compatibility_result_no_mangal_dosha_desc
source: Neither person has Mangal Dosha
hi: किसी भी व्यक्ति में मंगल दोष नहीं है

# compatibility_result_mangal_dosha
source: Mangal Dosha Detected
hi: मंगल दोष का पता चला

# compatibility_result_person1_dosha
source: Person 1 has Mangal Dosha
hi: व्यक्ति 1 में मंगल दोष है

# compatibility_result_person2_dosha
source: Person 2 has Mangal Dosha
hi: व्यक्ति 2 में मंगल दोष है

# compatibility_result_both_dosha
source: Both having Mangal Dosha can neutralize its effects
hi: दोनों में मंगल दोष होने से इसके प्रभाव को निष्प्रभावी किया जा सकता है

# compatibility_result_remedies_recommended
source: Remedies are recommended for better harmony
hi: बेहतर सामंजस्य के लिए उपाय की सिफारिश की जाती है

# compatibility_result_analysis
source: Compatibility Analysis
hi: अनुकूलता विश्लेषण

# compatibility_result_mental_harmony
source: Mental Harmony
hi: मानसिक सामंजस्य

# compatibility_result_physical_harmony
source: Physical Harmony
hi: शारीरिक सामंजस्य

# compatibility_result_emotional_harmony
source: Emotional Harmony
hi: भावनात्मक सामंजस्य

# compatibility_result_spiritual_harmony
source: Spiritual Harmony
hi: आध्यात्मिक सामंजस्य

# compatibility_result_remedies
source: Recommended Remedies
hi: अनुशंसित उपाय

# numerology_input_header
source: Enter Your Details
hi: अपने विवरण दर्ज करें

# numerology_input_subtitle
source: Discover the hidden meanings in your name and birth date
hi: अपने नाम और जन्म तिथि में छिपे अर्थों की खोज करें

# numerology_name_label
source: Full Name
hi: पूरा नाम

# numerology_name_hint
source: Enter your complete name
hi: अपना पूरा नाम दर्ज करें

# numerology_name_required
source: Please enter your full name
hi: कृपया अपना पूरा नाम दर्ज करें

# numerology_name_min_length
source: Name must be at least 2 characters
hi: नाम कम से कम 2 अक्षरों का होना चाहिए

# numerology_dob_label
source: Date of Birth
hi: जन्म तिथि

# numerology_dob_select
source: Select date
hi: तारीख चुनें

# numerology_dob_required
source: Please select date of birth
hi: कृपया जन्म तिथि चुनें

# numerology_what_discover
source: What You'll Discover
hi: आप क्या खोजेंगे

# numerology_life_path_desc
source: Your life's purpose and journey
hi: आपके जीवन का उद्देश्य और यात्रा

# numerology_destiny_desc
source: Your natural talents and abilities
hi: आपकी प्राकृतिक प्रतिभा और क्षमताएं

# numerology_soul_urge_desc
source: Your inner desires and motivations
hi: आपकी आंतरिक इच्छाएं और प्रेरणाएं

# numerology_lucky_numbers
source: Lucky Numbers
hi: भाग्यशाली संख्याएं

# numerology_lucky_numbers_desc
source: Numbers that bring you fortune
hi: संख्याएं जो आपके लिए भाग्य लाती हैं

# numerology_compatibility_label
source: Compatibility
hi: अनुकूलता

# numerology_compatibility_desc
source: Best matches for relationships
hi: संबंधों के लिए सर्वोत्तम मेल

# numerology_analyze_button
source: Analyze Numerology
hi: अंकशास्त्र विश्लेषण करें

# numerology_note
source: Numerology reveals the vibrational patterns in your name and birth date, offering insights into your personality, life path, and destiny.
hi: अंकशास्त्र आपके नाम और जन्म तिथि में कंपन पैटर्न प्रकट करता है, आपके व्यक्तित्व, जीवन पथ और भाग्य में अंतर्दृष्टि प्रदान करता है।

source: Numerology analysis completed
hi: अंकशास्त्र विश्लेषण पूर्ण

# numerology_analysis_failed
source: Failed to analyze numerology
hi: अंकशास्त्र विश्लेषण में विफल

# numerology_analysis_title
source: Numerology Analysis
hi: अंकशास्त्र विश्लेषण

# numerology_analysis_core_numbers
source: Your Core Numbers
hi: आपकी मुख्य संख्याएं

# numerology_analysis_life_path_label
source: Life Path
hi: जीवन पथ

# numerology_analysis_destiny_label
source: Destiny
hi: भाग्य

# numerology_analysis_soul_urge_label
source: Soul Urge
hi: आत्मा प्रेरणा

# numerology_analysis_life_path_title
source: Life Path Analysis
hi: जीवन पथ विश्लेषण

# numerology_analysis_destiny_title
source: Destiny Analysis
hi: भाग्य विश्लेषण

# numerology_analysis_soul_urge_title
source: Soul Urge Analysis
hi: आत्मा प्रेरणा विश्लेषण

# numerology_analysis_lucky_elements
source: Lucky Elements
hi: भाग्यशाली तत्व

# numerology_analysis_lucky_numbers_label
source: Lucky Numbers
hi: भाग्यशाली संख्याएं

# numerology_analysis_lucky_colors
source: Lucky Colors
hi: भाग्यशाली रंग

# numerology_analysis_lucky_days
source: Lucky Days
hi: भाग्यशाली दिन

# numerology_analysis_compatibility_title
source: Compatibility
hi: अनुकूलता

# numerology_analysis_best_matches
source: Best Matches
hi: सर्वोत्तम मेल

# numerology_analysis_challenging_matches
source: Challenging Matches
hi: चुनौतीपूर्ण मेल

# palmistry_upload_header
source: Capture Palm Images
hi: हाथ की छवियां कैप्चर करें

# palmistry_upload_subtitle
source: Take clear photos of both palms in good lighting for accurate analysis
hi: सटीक विश्लेषण के लिए अच्छी रोशनी में दोनों हाथों की स्पष्ट तस्वीरें लें

# palmistry_left_hand_label
source: Left Hand
hi: बायां हाथ

# palmistry_right_hand_label
source: Right Hand
hi: दायां हाथ

# palmistry_take_photo
source: Take Photo
hi: फोटो लें

# palmistry_choose_gallery
source: Choose from Gallery
hi: गैलरी से चुनें

# palmistry_remove_image
source: Remove image
hi: छवि हटाएं

# palmistry_tap_to_capture
source: Tap to capture
hi: कैप्चर करने के लिए टैप करें

# palmistry_analyze_button
source: Analyze Palmistry
hi: हस्तरेखा विश्लेषण करें

# palmistry_both_required
source: Please capture both left and right hand images
hi: कृपया बाएं और दाएं दोनों हाथों की छवियां कैप्चर करें

# palmistry_tips
source: Tips for best results: • Use good lighting • Keep palm flat and fingers spread • Avoid shadows on the palm • Capture the entire palm clearly
hi: सर्वोत्तम परिणामों के लिए सुझाव: • अच्छी रोशनी का उपयोग करें • हथेली को सपाट और उंगलियों को फैलाकर रखें • हथेली पर छाया से बचें • पूरी हथेली को स्पष्ट रूप से कैप्चर करें

# palmistry_upload_failed
source: Failed to capture image
hi: छवि कैप्चर करने में विफल

# palmistry_select_failed
source: Failed to select image
hi: छवि चुनने में विफल

# palmistry_upload_success
source: Palmistry analysis completed
hi: हस्तरेखा विश्लेषण पूर्ण

# palmistry_analysis_failed
source: Failed to upload images
hi: छवियां अपलोड करने में विफल

# palmistry_analysis_title
source: Palmistry Analysis
hi: हस्तरेखा विज्ञान विश्लेषण

# palmistry_analysis_summary
source: Analysis Summary
hi: विश्लेषण सारांश

# palmistry_analysis_major_lines
source: Major Palm Lines
hi: प्रमुख हथेली रेखाएं

# palmistry_analysis_mounts
source: Palm Mounts
hi: हथेली के पर्वत

# palmistry_analysis_fingers
source: Finger Analysis
hi: उंगली विश्लेषण

# palmistry_analysis_predictions
source: Predictions
hi: भविष्यवाणियां

# palmistry_analysis_health
source: Health
hi: स्वास्थ्य

# palmistry_analysis_career
source: Career
hi: करियर

# palmistry_analysis_relationships
source: Relationships
hi: संबंध

# palmistry_analysis_longevity
source: Longevity
hi: दीर्घायु

# onboarding_back
source: Back
hi: वापस

# onboarding_page_indicator
source: Page {current} of {total}
hi: पृष्ठ {current} का {total}

# onboarding_skip_hint
source: Double tap to skip introduction and go to login
hi: परिचय छोड़ने और लॉगिन पर जाने के लिए डबल टैप करें

# onboarding_back_hint
source: Double tap to go back
hi: वापस जाने के लिए डबल टैप करें

# onboarding_slide1_title
source: Career Guidance Made Simple
hi: करियर मार्गदर्शन सरल बनाया गया

# onboarding_slide1_subtitle
source: Discover Your Path
hi: अपना रास्ता खोजें

# onboarding_slide1_description
source: Get personalized career guidance based on ancient wisdom and modern AI technology
hi: प्राचीन ज्ञान और आधुनिक AI तकनीक के आधार पर व्यक्तिगत करियर मार्गदर्शन प्राप्त करें

# onboarding_slide2_title
source: Palmistry Analysis
hi: हस्तरेखा विश्लेषण

# onboarding_slide2_subtitle
source: Read Your Future
hi: अपना भविष्य पढ़ें

# onboarding_slide2_description
source: Upload your palm image and receive detailed analysis of your life lines and destiny
hi: अपनी हथेली की छवि अपलोड करें और अपनी जीवन रेखाओं और भाग्य का विस्तृत विश्लेषण प्राप्त करें

# onboarding_slide3_title
source: Vedic Jyotish
hi: वैदिक ज्योतिष

# onboarding_slide3_subtitle
source: Ancient Astrology
hi: प्राचीन ज्योतिष

# onboarding_slide3_description
source: Get insights from Vedic astrology based on your birth details and planetary positions
hi: अपने जन्म विवरण और ग्रह स्थिति के आधार पर वैदिक ज्योतिष से अंतर्दृष्टि प्राप्त करें

# onboarding_slide4_title
source: Numerology
hi: अंकशास्त्र

# onboarding_slide4_subtitle
source: Power of Numbers
hi: संख्याओं की शक्ति

# onboarding_slide4_description
source: Discover the hidden meanings in your numbers and how they influence your life
hi: अपनी संख्याओं में छिपे अर्थों को खोजें और जानें कि वे आपके जीवन को कैसे प्रभावित करती हैं

# onboarding_slide5_title
source: Personalized Reports
hi: व्यक्तिगत रिपोर्ट

# onboarding_slide5_subtitle
source: AI-Powered Insights
hi: AI-संचालित अंतर्दृष्टि

# onboarding_slide5_description
source: Receive comprehensive PDF reports with actionable guidance for your career and life
hi: अपने करियर और जीवन के लिए कार्रवाई योग्य मार्गदर्शन के साथ व्यापक PDF रिपोर्ट प्राप्त करें

# onboarding_slide6_title
source: Ready to Begin
hi: शुरू करने के लिए तैयार

# onboarding_slide6_subtitle
source: Start Your Journey
hi: अपनी यात्रा शुरू करें

# onboarding_slide6_description
source: Join thousands of users who have found clarity and direction with DishaAjyoti
hi: हजारों उपयोगकर्ताओं में शामिल हों जिन्होंने DishaAjyoti के साथ स्पष्टता और दिशा पाई है

# order_tracking_title
source: Order Tracking
hi: ऑर्डर ट्रैकिंग

# order_tracking_order_details
source: Order Details
hi: ऑर्डर विवरण

# order_tracking_order_id
source: Order ID
hi: ऑर्डर ID

# order_tracking_service
source: Service
hi: सेवा

# order_tracking_amount
source: Amount
hi: राशि

# order_tracking_order_date
source: Order Date
hi: ऑर्डर तिथि

# order_tracking_payment_id
source: Payment ID
hi: भुगतान ID

# order_tracking_completed_on
source: Completed On
hi: पूर्ण हुआ

# order_tracking_timeline
source: Order Timeline
hi: ऑर्डर समयरेखा

# order_tracking_order_placed
source: Order Placed
hi: ऑर्डर दिया गया

# order_tracking_payment_confirmed
source: Payment Confirmed
hi: भुगतान की पुष्टि

# order_tracking_payment_completed
source: Completed
hi: पूर्ण

# order_tracking_payment_pending
source: Pending
hi: लंबित

# order_tracking_processing
source: Processing
hi: प्रोसेसिंग

# order_tracking_processing_in_progress
source: In Progress
hi: प्रगति में

# order_tracking_processing_waiting
source: Waiting
hi: प्रतीक्षा में

# order_tracking_completed
source: Completed
hi: पूर्ण

# order_tracking_view_report
source: View Report
hi: रिपोर्ट देखें

# order_tracking_download_report
source: Download Report
hi: रिपोर्ट डाउनलोड करें

# order_tracking_opening_report
source: Opening report...
hi: रिपोर्ट खोली जा रही है...

# order_tracking_downloading_report
source: Downloading report...
hi: रिपोर्ट डाउनलोड हो रही है...

# order_tracking_status_pending
source: Your order is waiting for payment confirmation
hi: आपका ऑर्डर भुगतान की पुष्टि की प्रतीक्षा कर रहा है

# order_tracking_status_processing
source: Your report is being generated
hi: आपकी रिपोर्ट तैयार की जा रही है

# order_tracking_status_completed
source: Your report is ready to view
hi: आपकी रिपोर्ट देखने के लिए तैयार है

# order_tracking_status_failed
source: Order processing failed. Please contact support
hi: ऑर्डर प्रोसेसिंग विफल। कृपया सहायता से संपर्क करें

# order_tracking_status_cancelled
source: This order has been cancelled
hi: यह ऑर्डर रद्द कर दिया गया है
